" ===============================================
" If you write comments in Japanese, you need to set this at the beginning.
" ================================================
set encoding=utf-8
scriptencoding utf-8

" ================================================
" 文字コードの設定
" ================================================
" 保存時の文字コード
set fileencoding=utf-8
" 読み込み時の文字コードの自動判別、左側が優先
set fileencodings=ucs-boms,utf-8,euc-jp,cp932
" 改行コードの自動判別、左側が優先される
set fileformats=unix,dos,mac
"  □や○文字が崩れる問題を解決
set ambiwidth=double


" ================================================
" タブ・インテンドの設定
" ================================================






" ================================================
" 文字列検索
" ================================================
" インクリメンタルサーチ、１文字入力毎に検索を行う
set incsearch
" 検索パターンに大文字小文字を区別しない
set ignorecase
" 検索パターンに大文字を含んでいたら大文字小文字を区別する
set smartcase
" 検索結果をハイライト
set hlsearch
